// Задача 51: Задать двумерный массив следующим правилом: Aₘₙ = m+n.
Console.WriteLine("Hello, World!");
