// Задача 49: Показать двумерный массив размером m×n, заполненный вещественными числами.
Console.WriteLine("Hello, World!");
